Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/moving_to_ireland/rights_of_residence_in_ireland/residence_rights_of_family_members.html.txt.tmx
Source language: en
Languages: ga

source: Residence rights of family members
ga: Cearta cónaithe do bhaill teaghlaigh

source: If you move to Ireland for whatever reason, you may be able to bring your family members to live with you
ga: Cibé cúis a bhíonn agat chun bogadh go hÉirinn, tá seans ann go mbeidh tú in ann baill do theaghlaigh a thabhairt chun cónaí leat sa tír seo

source: Your rights in this respect depend on your nationality and on the type of residence entitlement you have
ga: Sa chás seo, braitheann do chearta ar do náisiúntacht nó ar an sórt cead cónaithe a bhíonn agat

source: Your family members’ right to stay in Ireland depends on your entitlement
ga: Braitheann cead fanachta bhaill do theaghlaigh in Éirinn ar do chead fanachta

source: They may of course, acquire an entitlement in their own right
ga: Ar ndóigh, is féidir leo siúd teidlíocht a fháil ina seilbh dhílis féin

source: A foreign national who marries or enters into a civil partnership with an Irish citizen does not have an automatic entitlement to live in Ireland
ga: Má phósann náisiúnach eachtrach saoránach Éireannach ní thugann sé seo teidlíocht cónaithe uathoibríoch dó/di

source: Your spouse or civil partner is governed by the same rules as apply to all foreign nationals
ga: Caithfidh do chéile nó pháirtnéir sibhialta na rialacha céanna a leanúint cosúil le gach náisiúnach eachtrannach

source: You can find a leaflet on residency information for family members and partners of Irish citizens on the website of Crosscare Migrant Project
ga: Tá bileog maidir le faisnéis cónaithe do bhaill teaghlaigh agus pháirtnéirí saoránach Éireannacha ar fáil ar an suíomh gréasáin Tionscadail Imirceach Crosscare

source: Other EEA and Swiss citizens
ga: Saoránaigh eile den AE/LEE agus saoránaigh na hEilvéise

source: If you are an EEA or Swiss citizen living in Ireland, then you have the right to bring certain family members to live with you here even if they are not themselves EEA or Swiss citizens
ga: Más saoránach den LEE nó saoránach den Eilvéis thú i do chónaí in Éirinn, tá sé de cheart agat mar sin, baill áirithe teaghlaigh a thabhairt chun cónaí leat anseo in Éirinn, fiù amháin mura saoránaigh den AE/LEE nó saoránaigh den Eilvéis iad féin

source: The main EU legislation at present is set out in Regulation No 1612/58 and Directive 2004/38/EC (pdf)
ga: Faoi láthair, leagtar amach príomhreachtaíocht an AE i Rialachán Uimh1612/58 agus Treorach 2004/38/PE (pdf)

source: The 2004 Directive is implemented in Ireland by the European Communities (Free Movement of Persons) Regulations 2015
ga: Cuirtear Treorach 2004 i bhfeidhm in Éirinn le Rialacháin na gComhphobail Eorpach (Saorthaisteal Daoine) 2015

source: You can find more information about these EU Treaty Rights on the Irish Naturalisation and Immigration Service website
ga: Tá tuilleadh faisnéise faoi na Cearta Conartha AE ar fáil ar shuíomh na Seirbhíse Eadóirseachta agus Inimirce na hÉireann

source: Most of the EU law on free movement also applies to citizens of the other EEA countries – Iceland, Norway and Liechtenstein
ga: Baineann an chuid is mó de dhlí an AE ar shaorthaisteal, le saoránaigh na tíortha eile LEE - An Íoslainn, An Ioruaidh agus Lichtinstéin

source: There are agreements with Switzerland which mean that Swiss nationals are treated in broadly the same way as EU nationals
ga: Tá conarthaí ann leis An Eilvéis a leagann amach go gcaitear mar an gcéanna, go ginearálta, le náisiúnaigh na hEilvéise agus le náisiúnaigh den AE

source: • Registered partners if the host member state treats such partnerships as equivalent to marriages; in Ireland civil partnership is equivalent to marriage for immigration purposes
ga: • Páirtithe cláraithe má ghlacann an ballstáit óstach leis gur ionann na páirtíochtaí sin agus póstaí; in Éirinn aithnítear an páirtnéireacht sibhialta mar choibhéis pósta le haghaidh cuspóirí inimirce

source: • Direct descendants who are aged under 21 or are dependants (of the EU citizen and the spouse or civil partner)
ga: • Sliocht díreach faoi bhun 21 bhliain d'aois, nó gur cleithiúnathe iad (den saoránach AE agus an chéile nó páirtí)

source: • Direct ancestors who are dependent
ga: • Sinsear díreach atá ina c(h)leithiúnaí

source: Other family members who do not have an absolute right may be able to move to Ireland
ga: Féadfaidh baill eile teaghlaigh, nach mbíonn i dteideal cearta uathoibhríocha, bogadh go hÉirinn

source: The Directive requires member states to facilitate the entry and residence of:
ga: De réir na Treorach, caithfidh na baill stáit comhoibriú le teacht isteach agus cónaí:

source: • Family members who are dependants or members of the household of the EU citizen or where serious health grounds strictly require the personal care of the family member by the EU citizen and
ga: • Baill teaghlaigh gur cleithiúnaithe iad nó baill teaghlaigh de shaoránach AE nó go gcaithfidh an saoránach AE aire pearsanta a thabhairt don bhall teaghlaigh de bharr cúiseanna sláinte dáiríre agus

source: • A partner with whom the EU citizen has a durable relationship
ga: • Páirtí go bhfuil caidreamh buan aige/aici le saoránach an AE

source: The Irish authorities consider applications for residence cards from partners of EU nationals who can establish that the relationship has existed for at least 2 years
ga: Déanann údaráis na hÉireann staidéar ar iarratais ar chártaí cónaithe ó pháirtithe náisiúnach AE gur féidir leo a thaispeáint go raibh caidreamh buan acu lena chéile ar feadh 2 bhliain ar a laghad

source: These other dependants or partners who are not qualifying family members are permitted family members
ga: Mura na cleithiúnaithe eile nó pháirtithe baill teaghlaigh cáilithe iad, is baill teaghlaigh ceadaithe iad

source: The immigration authorities are required to undertake an extensive examination of the personal circumstances in these cases and must justify any refusal of entry or residence
ga: Caithfidh na húdaráis inimirce scrúdú fairsing a dhéanamh ar chúinsí pearsanta sna cásanna seo, agus caithfear seasamh lena mbeart maidir le diúltú don iarratas teacht isteach nó diúltú don iarratas cónaí

source: In general, your family members retain the right to live here if you die or if they cease to be a spouse or civil partner
ga: Go ginearálta, coimeádann baill do theaghlaigh teideal cónaithe fiú má fhaigheann tú bás nó murar céile nó páirtí iad a thuilleadh

source: You are entitled to permanent residence after 5 years
ga: Tá teidlíocht agat do chónaí buan tar éis cúig bliana

source: Your family members have the same entitlement
ga: Tá an teidlíocht céanna ag baill do theaghlaigh

source: People with international protection
ga: Daoine le cosaint idirnáisiúnta

source: If you have international protection (refugee status or subsidiary protection) in Ireland or you are a Programme refugee, you may apply for members of your family to be given permission to come and live in Ireland
ga: Má bhronntar cosaint idirnáisiunta (stáideas dídeanaí nó cosaint choimhdeach) duit, d'fhéadfá iarratas a sheoladh isteach chun cead isteach go hÉirinn agus cead cónaithe in Éirinn a fháil do bhaill do theaghlaigh

source: In general, the Minister for Justice and Equality must grant permission to your spouse, civil partner and dependent children aged under 18
ga: Go ginearálta, caithfidh an tAire Dlí agus Cirt agus Comhionannais cead a thabhairt do do chéile nó pháirtnéir sibhialta agus do phaistí cleithiúnaithe faoi bhun18 mbliana d'aois

source: If you are under 18, permission must be granted to your parents
ga: Mura bhfuil 18 mbliana slánaithe agat caithfear cead a thabhairt do do thuismitheoirí

source: People granted permission to remain on humanitarian grounds do not have all of the same rights as persons granted refugee or subsidiary protection status
ga: Tá go leor de na cearta céanna ag daoine a fhaigheann cead fanachta ar chúis dhaonnúil agus atá ag daoine a bhaineann stádas dídeanaithe nó cosanta coimhdí amach

source: They do not have the right to family reunification but anyone who is entitled to reside and remain in the State may apply to the Minister to permit family members to join them
ga: Níl an ceart acu chun athaontú teaghlaigh ach féadann aon duine a bhíonn i dteideal cónaí agus fanacht sa Stát cur isteach chuig an Aire chun ceadú do bhaill teaghlaigh a bheith leo

source: The Minister for Justice and Equality can grant or refuse permission on a discretionary basis
ga: Féadann an tAire Dlí agus Cirt agus Comhionannais cead a bhronnadh nó a dhiúltú ar bhonn discréideach

source: If you are from outside the EEA or Switzerland, then your right to have family members come to live with you depends on the rules governing your presence in Ireland
ga: Mura dtagann tú ón LEE nó ón Eilvéis, bíonn sé de cheart agat mar sin baill do theaghlaigh a thabhairt chun cónaí leat ag brath ar na rialacha a ghabhann le do láithreacht in Éirinn

source: At present, there is no legislation governing rights of residence for this group
ga: Faoi láthair, níl reachtaíocht ar bith ag gabháil le cearta cónaithe an ghrúpa seo

source: The description here is of the current administrative arrangements
ga: Níl anseo ach cur síos ar na sochruithe riaracháin reatha

source: It is open to you to apply to the Irish Naturalisation and Immigration Service (INIS) for anyone (including a partner) to be allowed join you in Ireland - see 'How to apply' below
ga: Beidh ort féin iarratas a sheoladh isteach chuig Seirbhís Eadóirseachta agus Inimirce na hÉireann chun cead isteach a fháil d'éinne (ag cur páirtí san áireamh) teacht chun cónaí leat in Éirinn - féach 'Conas iarratas a dhéanamh' thíos

source: Family members are generally spouses, civil partners and children under the age of 18
ga: De ghnáth, glaotar baill teaghlaigh ar chéilí/pháirtnéirí sibhialta agus ar pháistí faoi bhun 18 mbliana d'aois

source: It is not the general policy to allow dependants over the age of 18 to join you in Ireland
ga: Ní polasaí ginearálta é cead a thabhairt do chleithiúnaithe os cionn 18 mbliana d'aois teacht chun cónaí leat in Éirinn

source: You may be able to make a case as to why you should be an exception to this general rule
ga: B'fhéidir go bhféadfá an scéal a phlé chun a thaispeáint nár cheart tusa a chur san áireamh maidir leis an riail ginerálta seo

source: Your family members’ right to remain in Ireland depends on your right to remain
ga: Braitheann cead fanachta bhaill do theaghlaigh in Éirinn ar do chead fanachta

source: They may of course, become entitled to a right of residence in their own right, for example, by getting a Critical Skills or General Employment Permit
ga: D'fhéadfadh siad teacht i dteideal ar cheart cónaithe ina seilbh dhílis féin, mar shampla, trí Cead Fostaíochta Scileanna Ríthábhachtacha nó Cead Fostíochta Ginearálta a fháil

source: If you have a Critical Skills Employment Permit, you may bring your family to live with you in Ireland immediately
ga: Má bhíonn Cead Fostaíochta Scileanna Ríthábhachtacha agat, d'fhéadfá do theaghlach a thabhairt chun cónaí leat in Éirinn láithreach bonn

source: Your spouse, civil partner and dependants may then get Dependant/Partner/Spousal Employment Permits
ga: Beidh ceadanna oibre do chéile/do chleithiúnach ar fáil ansin ag do chéile, do pháirtnéir sibhialta agus ag do chuid cleithiúnaithe

source: If you have a General Employment Permit, you may be able to bring your family to live here after you have been legally working here for a year
ga: Má bhíonn Cead Fostaíochta Ginearálta agat, d'fhéadfá do theaghlach a thabhairt chun cónaí anseo tar éis duit a bheith ag obair anseo go dlíthiúil ar feadh bliana

source: You also have to be able to show that you will be able to support them
ga: Caithfidh tú a thaispeáint freisin go mbeidh tú ábalta déanamh dóibh

source: In practice, you need to be earning an income above the limits for Family Income Supplement
ga: Go praicticiúil, beidh ort a bheith ag fáil tuarastail thar chuimse don Fhorlíonadh Ioncaim Teaghlaigh

source: Your spouse, civil partner and dependants aged under 18 may apply for a General Employment Permit once they are legally resident in Ireland
ga: Nuair a bheidh cónaí dlíthiúil ag do chéile, do pháirtnéir sibhialta agus do chuid cleithiúnaithe faoi a 18 in Éirinn, beidh siad ábalta iarratas a sheoladh isteach ar chead oibre

source: It is not the general policy to allow family members to join students who are in Ireland as students
ga: Ní polasaí ginearálta é go dtugtar cead do bhaill teaghlaigh teacht chun cónaí le mic léinn a bhíonn ag staidéar in Éirinn

source: Parents of Irish-born children
ga: Tuismitheoirí le páistí a rugadh in Éirinn

source: If you have been granted residence in Ireland under the Irish Born Child Scheme, it is not the general policy to allow family members to come and live with you
ga: Dá mba rud é gur tugadh cead cónaithe duit in Éirinn faoin Scéim um Leanaí a Rugadh in Éirinn, ní polasaí ginearálta é go dtugtar cead isteach do bhaill teaghlaigh chun cónaí leat anseo

source: Requirement to produce identity documents
ga: Riachtanas doiciméid aitheantais a thabhairt ar aird

source: The Civil Law (Miscellaneous Provisions) Act 2011 (section 34) provides that non-EEA nationals arriving in the State must present a passport or equivalent document when asked for it by an immigration officer
ga: Soláthraíonn an tAcht um an Dlí Sibhialta (Forálacha Ilghnéitheacha) 2011 alt 34 gur mór do náisiúnaigh neamh-LEE atá ag teacht isteach sa Stát, pas nó doiciméad coibhéiseach a thabhairt nuair a iarrann oifigeach imirce orthu

source: (Previously, it was not specifically stated that they had to present it.)
ga: (Roimhe seo, ní raibh sé sonraithe gur mór dóibh é a thabhairt.)

source: It also requires non-EEA nationals who are present in the State to provide such a document or a registration certificate on demand to the Minister, an immigration officer or a Garda, if asked to do so to prove that they comply with their permission to remain in the State
ga: Éilítear ar náisiúnaigh neamh-LEE atá láithreach sa Stát doiciméad nó teastas chlárú a thabhairt don Aire, d’oifigeach imirce nó do Gharda, má iarrtar orthu, chun cruthú um chomhlíonadh ceada fanacht sa Stát

source: This requirement does not apply to people under 16 years of age, but it does now apply to non-EEA nationals who were born in Ireland
ga: Ní bhaineann an riachtanas seo le daoine faoi bhun 16 bliana d’aois ach baineann sé anois le náisiúnaigh neamh-LEE a rugadh in Éirinn

source: Section 34 does not apply to people who are exercising EU Treaty Rights of free movement
ga: Ní bhaineann Alt 34 le daoine a fheidhmíonn an ceart atá acu chun saorghluaiseachta

source: However, anyone seeking to enter or live in the State on the basis of being an EEA national or a dependant of an EEA national is still required to provide satisfactory evidence of identity and nationality to establish that basis
ga: Áfach, má iarrann aon duine cead teacht isteach nó cónaí in Éirinn ar bhonn náisiúntacht LEE nó cleithiúnaí náisiúnaigh LEE, ní mór dóibh leorfhianaise aitheantais agus náisiúntachta a sholáthar chun an bonn seo a fhaigh amach

source: For a visa for a non-EEA national family member: You must apply for a visa online
ga: Iarratas ar víosa do bhall teaghlaigh náisiúnach neamh-LEE: Caithfidh tú cur isteach ar an víosa ar-líne

source: There are INIS guidelines about visa requirements for family reunification for workers (pdf)
ga: Tá treoirlínte SEIÉ faoi riachtanais víosaí chun bhall teaghlaigh oíbrithe a athcheangal (pdf)

source: For a residence card for a non-EEA national qualifying family member, apply using application form EU 1 (pdf) and explanatory leaflet (pdf)
ga: Iarratas ar chárta cónaithe do bhall teaghlaigh náisiúnach neamh-LEE cáilithe: úsáid foirm iarratais EU 1 (pdf) agus an bhileog mhínitheach (pdf) chun iarratas a sheoladh isteach

source: For a residence card for a non-EEA national permitted family member, apply using application form EU 1A (pdf) and explanatory leaflet (pdf)
ga: Iarratas ar chárta cónaithe do bhall teaghlaigh náisiúnach neamh-LEE ceadaithe: úsáid foirm iarratais EU 1A (pdf) agus an bhileog mhínitheach (pdf) chun iarratas a sheoladh isteach

source: For a permanent residence certificate for an EU citizen who has lived in the State for 5 years apply using application form EU 2 (pdf) and explanatory leaflet (pdf)
ga: Iarratas ar theastas do chónaí buan do shaoránach AE atá ina chónaí sa Stát ar feadh 5 bliana, úsáid foirm iarratais EU 2 (pdf) agus an bhileog mhínitheach (pdf) chun iarratas a sheoladh isteach

source: For a permanent residence card for a family member who has lived in the State for 5 years apply using application form EU 3 (pdf)and explanatory leaflet (pdf)
ga: Iarratas ar chárta do chónaí buan do bhall teaghlaigh atá ina chónaí sa Stát ar feadh 5 bliana úsáid foirm iarratais EU 3 (pdf) agus an bhileog mhínitheach (pdf) chun iarratas a sheoladh isteach

source: Completed application forms should be returned to the EU Treaty Rights Section of the Irish Naturalisation and Immigration Service (INIS)
ga: Caithfear foirmeacha comhlánaithe a sheoladh ar ais chuig Ionad Cearta Chonradh an AE ag Seirbhís Eadóirseachta agus Inimirce na hÉireann (SEIÉ)

source: If your EU 1, EU 2 or EU 3 application has been refused you can request a review of this decision using form EU 4 (pdf) and explanatory leaflet (pdf)
ga: Má tá d'iarratas EU1, EU 2 nó EU 3 diúltaithe, is féidir iarratas ar athbhreathnú na cinneadh seo tríd an fhoirm EU 4 (pdf) agus an bhileog mhínitheach (pdf) a úsáid

source: Following divorce or annulment or the death or departure of the EU citizen, a holder of an EU1 residence card can apply to retain a residence card using application form EU5 (pdf) and explanatory leaflet (pdf)
ga: I ndiaidh colscaradh nó neamhniú nó bás nó imeacht an saoránach AE, is féidir sealbhóir cárta cónaithe EU 1 iarratas a dhéanamh ar chárta cónaithe a choinneáil trí úsáid na foirme iarratais EU 5 (pdf) agus an bhileoig mhínitheach (pdf)

source: For an Immigration Certificate of Registration:
ga: Chun Teastas Clárú Inimirce a fháil:

source: Apply to your local immigration registration office
ga: Seol d’iarratas chuig d'oifigeach clárú inimirce áitiúil

source: In Dublin this is the Burgh Quay Registration Office - see 'Where to apply' below
ga: Má tá cónaí ort i mBaile Átha Cliath, seol isteach é chuig Oifig Chlárúcháin Cé an Bhúrcaigh - féach 'Cá háit a dhéanfaidh mé iarratas' thíos

source: Since 15 September 2016, you must book an appointment online to visit it
ga: Ó 15 Meán Fómhair 2016, caithfidh tú coinne a scríobh isteach ar líne chun cuairt a thabhairt air

source: Outside Dublin this is at your regional registration office or your local Garda District Headquarters
ga: Lasmuigh de Bhaile Átha Cliath, seol isteach é chuig oifig chlárúcháin régiúnach nó chuig Ceanncheathrú Ceantair an Gharda Síochána

source: If you are in a de facto relationship you can find information about permission to remain on the INIS website
ga: Má tá tú i ngaol eisphósta nó de facto tá tuilleadh eolais faoi chead fanacht ar an suíomh BNGI

source: You can read more about non-EEA family reunification in the policy guidelines (pdf) available on the INIS website
ga: Is féidir léamh tuilleadh faoi bhall teaghlaigh neamh-LEE a athcheangal sna treoirlínte polasaí (pdf) ar fáil ar an suíomh SEIÉ
